---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisCreateAnalyticalModel
source: html/02371865-6e79-3436-0d5c-b19890118c7b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisCreateAnalyticalModel Property

"Create Energy Model"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get; }
```